# Вводится целое число 0 или 1. 
# Необходимо преобразовать их в строки: 0 - в "False", 1 - в "True". 
# Реализовать это с помощью тернарного условного оператора. Результат отобразить на экране.

i = int(input())

b = True if i == 1 else False
print(b)
