Напишите программу, которая принимает на вход два вещественных числа в одну строку через пробел и выводит на экран их сумму.


# put your python code here
s1, s2 = map(float,input().split())
print(s1 + s2)
